import style from './MotivationWorker.module.scss';
import {Tabs} from "../tabs/Tabs";

export const MotivationWorker = () => {
    return (
        <section className={style.motivationWorkerSection}>
            <div className='container'>
              <h4 className="sectionTitle">Мотивация сотрудников</h4>
              <ol>
                <li>Помогаем с получением рабочей визы.  🤫 Делаем приглашение на работу 5-7 дней.  Готовим договор и знакомим вас с работодателем.
                  🔥 Выделяем руско / Укр говорящего куратора.</li>
                <li>Помогаем с получением рабочей визы.  🤫 Делаем приглашение на работу 5-7 дней. Готовим договор и знакомим вас с работодателем.
                  🔥 Выделяем руско / Укр говорящего куратора.</li>
                <li> Помогаем с получением рабочей визы.  🤫 Делаем приглашение на работу 5-7 дней. Готовим договор и знакомим вас с работодателем.
                  🔥 Выделяем руско / Укр говорящего куратора.</li>
              </ol>
            </div>
        </section>
    )
}





